name: "real_esrganx4_fp16_tensorrt"
platform: "tensorrt_plan"
max_batch_size: 0
input [
    {
        name: "input"
        data_type: TYPE_FP16
        dims: [-1, 3, -1, -1]
    }
]
output [
    {
        name: "output"
        data_type: TYPE_FP16
        dims: [-1, 3, -1, -1]
    }
]
instance_group [
    {
      count: 1
      kind: KIND_GPU
      gpus: [0]
    }
]